---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyBadUnattachedVoids
source: html/109ad46b-a763-44ff-061e-c94eddb089fa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyBadUnattachedVoids Property

Family '[Family Name]' contains unattached voids that can't be combined for cutting. Try fixing the voids or unset the Cut with Voids parameter in the family.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyBadUnattachedVoids { get; }
```